app/controllers/api/groups_controller.rb

  def index
    if params[:searchInput]
      @groups = Group.all.where('LOWER(title) ~ LOWER(?)', params[:searchInput])
    else
      @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def show

    # debugger
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]